In [ ]:
import pandas as pd

In [ ]:
pd?

In [ ]:
import numpy as np

In [ ]:
data = pd.Series([0.25, 0.5, .75, 1])
data

In [ ]:
data.values

In [ ]:
data.index

In [ ]:
data = pd.Series([0.25, 0.5, .75, 1], index=['a', 'b', 'c', 'd'])

In [ ]:
data

In [ ]:
population_dict = {'California': 38332521,
                           'Texas': 26448193,
                           'New York': 19651127,
                           'Florida': 19552860,
                           'Illinois': 12882135}
population = pd.Series(population_dict)
population

In [ ]:
population['California': 'Texas']

In [ ]:
pd.Series({2:'a', 1:'b',3:'c'})

In [ ]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

In [ ]:
states = pd.DataFrame({'population': population, 'area': area})
states

In [ ]:
states.index

In [ ]:
states.columns

In [ ]:
states.values

In [ ]:
pd.DataFrame(area, columns=['area'])

In [ ]:
data = [{'a': i, 'b': 2*i} for i in range(3)]
pd.DataFrame(data)

In [ ]:
pd.DataFrame([{'a':1, 'b':2}, {'a': 3, 'c':4}])

In [ ]:
pd.DataFrame([{'a':3, "b":4, "c":2}, {'a':3, 'b':4}])

In [ ]:
pd.DataFrame({'population': population, 'area': area})

In [ ]:
pd.DataFrame(np.random.rand(3,2), index=['a','b','c'], 
             columns=['name', 'area'])

In [ ]:
a = np.zeros(3, dtype=[('a', 'i8'), ('b','f8')])
a

In [ ]:
pd.DataFrame(a)

In [ ]:
ind = pd.Index([2,3,4,6,5])
ind

In [ ]:
ind[0]=1

In [ ]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [ ]:
indA & indB

In [ ]:
indA | indB

In [ ]:
indA ^ indB

In [ ]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                        index=['a', 'b', 'c', 'd'])

In [ ]:
'a' in data

In [ ]:
data.keys()

In [ ]:
list(data.items())

In [ ]:
data['e'] = 1.25

In [ ]:
data

In [ ]:
data['a': 'c']

In [ ]:
data[0:2]

In [ ]:
data[(data>0.3) & (data> 0.5)]

In [ ]:
data[['a','b']]

In [ ]:
data

In [ ]:
data.loc['a']

In [ ]:
data.iloc[0]

In [ ]:
data.loc['a':'c'], data['a':'c'], data[0:2]

In [ ]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

In [ ]:
#explicit
data[1]

In [ ]:
#implicit
data[1:3]

In [ ]:
#explicit always
data.loc[1]

In [ ]:
data.loc[1:3]

In [ ]:
#iloc implicit always
data.iloc[1]

In [ ]:
data.iloc[1:3]

In [ ]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                          'New York': 141297, 'Florida': 170312,
                          'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                         'New York': 19651127, 'Florida': 19552860,
                         'Illinois': 12882135})

In [ ]:
data = pd.DataFrame({'area': area, 'population': population})
data

In [ ]:
data['area']

In [ ]:
data.area

In [ ]:
data.area is data['area']

In [ ]:
data['density']= data['population']/data['area']
data

In [ ]:
data.values

In [ ]:
data.T

In [ ]:
data.values[0]

In [ ]:
data['area']

In [ ]:
#iloc index loc
data.iloc[:2,:3]

In [ ]:
data.loc[:'Florida', :'population']

In [ ]:
data.ix[:3, :'population']

In [ ]:
data.loc[data.density> 100, ['population', 'density']]

In [ ]:
data.iloc[0,2] = 90
data

In [ ]:
data[1:3]

In [ ]:
data[data.density>100]

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10, 4))
ser

In [ ]:
df = pd.DataFrame(rng.randint(0,10,(3,4)), 
                 columns=['a','b','c','d'])
df

In [ ]:
np.exp(ser)

In [ ]:
np.sin(df * np.pi/4)

In [ ]:
area =pd.Series({'Alaska': 1723337, 'Texas': 695662,
                         'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                               'New York': 19651127}, name='population')

In [ ]:
population/area

In [ ]:
area.index | population.index

In [ ]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A+B

In [ ]:
A.add(B, fill_value=0.0)

In [ ]:
A = pd.DataFrame(rng.randint(0,20,(2,2)), columns=list('AB'))
A

In [ ]:
b = pd.DataFrame(rng.randint(0,10,(3,3)), columns=list('ABC'))
b

In [ ]:
A +b

In [ ]:
fill= A.stack().mean()
fill

In [ ]:
A.add(b, fill_value=fill)

In [ ]:
A = rng.randint(10, size=(3,4))
A

In [ ]:
A  -A[0]

In [ ]:
df =pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[1]

In [ ]:
df.subtract(df['R'], axis=0)

In [ ]:
halfrow = df.iloc[0, ::2]
halfrow.shape

In [ ]:
df

In [ ]:
halfrow

In [ ]:
df.subtract(halfrow)

In [ ]:
mean = df.stack().mean()
mean

In [ ]:
vals1 = np.array([1, None, 3, 4])
vals1

In [ ]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()

In [ ]:
vals2  = np.array([1, np.nan, 3, 4])
vals2.dtype

In [ ]:
#because of nan
vals2.sum(), vals2.max(), vals2.min()

In [ ]:
#use nan if "nan" is present
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

In [ ]:
pd.Series([1, np.nan, 2, None])

In [ ]:
x = pd.Series(np.arange(2), dtype=int)
x

In [ ]:
x[0]= None

In [ ]:
x

In [ ]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

In [ ]:
data.notnull()

In [ ]:
data[data.notnull()]

In [ ]:
data.dropna()

In [ ]:
df = pd.DataFrame([[1, np.nan, 2],
                  [2,      3,      5],
                   [np.nan, 4,      6]])
df

In [ ]:
#will drop alwasys row
df.dropna()

In [ ]:
df.dropna(axis='columns')

In [ ]:
df[3]= np.nan
df

In [ ]:
df.dropna(axis='columns', how='all')

In [ ]:
#require thst many nan valuues
df.dropna(axis='rows', thresh =3)

In [ ]:
data = pd.Series([1, np.nan, None, 3], index=list('abcd'))
data

In [ ]:
data.fillna(0)

In [ ]:
data.fillna(method='ffill')

In [ ]:
data.fillna(method='bfill')

In [ ]:
df

In [ ]:
df.fillna(method='ffill',axis=1)

In [ ]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

In [ ]:
pop[('California', 2010):('Texas', 2000)]

In [ ]:
pop[[i for i in pop.index if i[1]== 2010]]

In [ ]:
#convert index of multidimension to tuple
index = pd.MultiIndex.from_tuples(index)
index

In [ ]:
pop = pop.reindex(index)
pop

In [ ]:
pop[:,2010]

In [ ]:
pop_df = pop.unstack()
pop_df

In [ ]:
pop_df.stack()

In [ ]:
 pop_df = pd.DataFrame({'total': pop,
                               'under18': [9267089, 9284094,
                                           4687374, 4318033,
                                           5906301, 6879014]})
pop_df

In [ ]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18

In [ ]:
f_u18.unstack()

In [ ]:
df= pd.DataFrame(np.random.rand(4,2),
                index=[['a','a','b','b'],[1,2,1,2]],
                columns=['data1', 'data2'])
df

In [ ]:
df_ustack = df.unstack()
df_ustack

In [ ]:
df_stack = df_ustack.stack()
df_stack

In [ ]:
data = {('California', 2000): 33871648,
                ('California', 2010): 37253956,
                ('Texas', 2000): 20851820,
                ('Texas', 2010): 25145561,
                ('New York', 2000): 18976457,
                ('New York', 2010): 19378102}
pd.Series(data)

In [ ]:
pd.MultiIndex.from_arrays([['a','a','b','b'],
                          [1,2,1,2]])

In [ ]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

In [ ]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

In [ ]:
pd.MultiIndex(levels=[['a','b'],[1,2]],
        labels=[[0,0,1,1],[0,1,0,1]])

In [ ]:
pop

In [ ]:
pop.index.names = ['state','year']
pop

In [ ]:
index = pd.MultiIndex.from_product([[2013,1014],[1,2]],
                                    names=['year','visit'])
columns= pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'],
                                    ['HR','TEMP']],
                                   names=['Subject', 'type'])

In [ ]:
data = np.round(np.random.randn(4,6), 1)
data[:, ::2] *= 10
data +=37
data

In [ ]:
healt_data = pd.DataFrame(data=data,
                          index= index,
                          columns=columns)
healt_data

In [ ]:
healt_data['Guido']

In [ ]:
pop

In [ ]:
pop['California',2000]

In [ ]:
pop['California']

In [ ]:
pop.loc['California':'New York']

In [ ]:
pop[:,2000]

In [ ]:
pop[pop>22000000]

In [ ]:
pop[['California','Texas']]

In [ ]:
healt_data['Guido','HR']

In [ ]:
healt_data.iloc[:2,:3]

In [ ]:
healt_data.loc[:,('Bob','HR')]

In [ ]:
#idx = pd.IndexSlice
#healt_data.loc[idx[:, 1], idx[:, 'HR']]
#UnsortedIndexError

In [ ]:
index = pd.MultiIndex.from_product([['a','c', 'b'],
                                   [1,2]])
data = pd.Series(np.random.rand(6), index= index)
data.index.names = ['char', 'int']
data

In [ ]:
# index = pd.MultiIndex.from_product([['a','b', 'v'], [1,2,3]])
# data = pd.Series(np.random.randint(9), index=index)
# data.index.names = ['char', 'int']
# data

In [ ]:
#index columns is not sorted use data.sort_index()
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

In [ ]:
data= data.sort_index()
data

In [ ]:
data['a':'b']

In [ ]:
pop

In [ ]:
#level tell which index columns
pop.unstack(level=1)

In [ ]:
 pop.unstack(level=0)

In [ ]:
pop.unstack(level=0).stack()

In [ ]:
pop_flat= pop.reset_index(name='population')
pop_flat

In [ ]:
pop_flat.set_index(['state','year'])
#important in real world

In [ ]:
healt_data

In [ ]:
data_mean= healt_data.mean(level=0)
data_mean

In [ ]:
data_mean.mean(axis=1, level='type')

In [ ]:
def make_df(cols, ind):
    data= {c: [str(c) + str(i) for i in ind]
          for c in cols}
    return pd.DataFrame(data, ind)

make_df('ABC', range(3))

In [ ]:
x = np.array([[1,2],[3,4]])
np.concatenate([x,x], axis=1)

In [ ]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1,2,3])
ser2 = pd.Series(['D','E','F'], index=[4,5,6])
pd.concat([ser1, ser2], axis=0)

In [ ]:
df1 = make_df('AB', [1,2])
df2 = make_df('AB', [3,4])
print(df1)
print(df2)
print(pd.concat([df1,df2]))

In [ ]:
df3 = make_df('AB', [0,1])
df4 = make_df('CD', [0,1])
print(df3);
print(df4);
print(pd.concat([df3, df4], axis='columns'))

In [ ]:
# df3 = make_df('AB', [0,1])
# df4 = make_df('AB', [0,1])
# print(df3);
# print(df4);
# print(pd.concat([df3, df4], axis='rows'))

In [ ]:
x = make_df('AB', [0,1])
y = make_df('AB', [0,1])
print(x);
print(y);
print(pd.concat([x,y], axis='rows'))

In [2]:
import pandas as pd
pop = pd.read_csv('.\data-USstates-master\state-population.csv')
areas = pd.read_csv('./data-USstates-master/state-areas.csv')
abbrevs = pd.read_csv('./data-USstates-master/state-abbrevs.csv')

In [3]:
print(pop.head()); print(areas.head()); print(abbrevs.head());

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [5]:
merged = pd.merge(pop, abbrevs, how='outer',
                 left_on='state/region',
                 right_on='abbreviation')
merged = merged.drop('abbreviation', 1)

merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [6]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [10]:
merged[merged['population'].isnull()].head(20)
merged[merged['state/region']== 'USA'].head()

     state/region     ages  year   population state
2496          USA  under18  1990   64218512.0   NaN
2497          USA    total  1990  249622814.0   NaN
2498          USA    total  1991  252980942.0   NaN
2499          USA  under18  1991   65313018.0   NaN
2500          USA  under18  1992   66509177.0   NaN

In [17]:
#first is condition second is value whose first value is null
merged.loc[merged['state'].isnull(), 'state/region' ].unique()

array(['PR', 'USA'], dtype=object)

In [18]:
merged['state/region'].unique()

array(['AL', 'AK', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'DC', 'FL', 'GA',
       'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MD', 'MA',
       'MI', 'MN', 'MS', 'MO', 'MT', 'NE', 'NV', 'NH', 'NJ', 'NM', 'NY',
       'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
       'UT', 'VT', 'VA', 'WA', 'WV', 'WI', 'WY', 'PR', 'USA'],
      dtype=object)

In [19]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [20]:
print(merged.head()); print(areas.head());

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [21]:
final = pd.merge(merged, areas, on='state', how='left'  )
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [22]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [23]:
final.loc[final['area (sq. mi)'].isnull(), 'state'].unique()

array(['United States'], dtype=object)

In [24]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [25]:
final.loc[final['area (sq. mi)'].isnull(), 'state'].unique()

array([], dtype=object)

In [26]:
data2010 = final.query("year == 2010 & ages =='total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [27]:
data2010.set_index('state', inplace=True)

In [28]:
data2010.head()

           state/region   ages  year  population  area (sq. mi)
state
Alabama              AL  total  2010   4785570.0        52423.0
Alaska               AK  total  2010    713868.0       656425.0
Arizona              AZ  total  2010   6408790.0       114006.0
Arkansas             AR  total  2010   2922280.0        53182.0
California           CA  total  2010  37333601.0       163707.0

In [29]:

density = data2010['population']/ data2010['area (sq. mi)']

In [30]:
density.sort_values(ascending=False, inplace=True)
density.head(20)

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
Massachusetts            621.815538
Maryland                 466.445797
Delaware                 460.445752
New York                 356.094135
Florida                  286.597129
Pennsylvania             275.966651
Ohio                     257.549634
California               228.051342
Illinois                 221.687472
Virginia                 187.622273
Indiana                  178.197831
North Carolina           177.617157
Georgia                  163.409902
Tennessee                150.825298
South Carolina           144.854594
dtype: float64

In [31]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

In [34]:
density.index.unique()

Index(['District of Columbia', 'Puerto Rico', 'New Jersey', 'Rhode Island',
       'Connecticut', 'Massachusetts', 'Maryland', 'Delaware', 'New York',
       'Florida', 'Pennsylvania', 'Ohio', 'California', 'Illinois', 'Virginia',
       'Indiana', 'North Carolina', 'Georgia', 'Tennessee', 'South Carolina',
       'New Hampshire', 'Hawaii', 'Kentucky', 'Michigan', 'Washington',
       'Texas', 'Alabama', 'Louisiana', 'Wisconsin', 'Missouri',
       'West Virginia', 'Vermont', 'Mississippi', 'Minnesota', 'Arizona',
       'Arkansas', 'Iowa', 'Oklahoma', 'Colorado', 'Oregon', 'Maine', 'Kansas',
       'Utah', 'Nevada', 'Nebraska', 'Idaho', 'New Mexico', 'South Dakota',
       'North Dakota', 'Montana', 'Wyoming', 'Alaska'],
      dtype='object', name='state')

In [35]:
import seaborn as sns
planets = sns.load_dataset('planets')

In [36]:
planets.shape

(1035, 6)

In [37]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [39]:
import numpy as np
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [40]:
ser.sum()

2.811925491708157

In [41]:
ser.mean()

0.5623850983416314

In [42]:
df = pd.DataFrame({'A': rng.rand(5),
                  'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [45]:
df.sum(axis='columns')

0    0.176579
1    1.027993
2    1.698619
3    0.813454
4    0.889898
dtype: float64

In [46]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [47]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [48]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [49]:
df = pd.DataFrame({'key': ['A','B', 'C', 'A', 'B', 'C'],
               'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [50]:
df.groupby('key')

In [51]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [55]:
planets['method'].unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [56]:
planets.groupby('method')

In [57]:
planets.groupby('method')['orbital_period']

In [58]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [63]:
planets[planets['method']=="Transit Timing Variations"]

                        method  number  orbital_period  mass  distance  year
680  Transit Timing Variations       2        160.0000   NaN    2119.0  2011
736  Transit Timing Variations       2         57.0110   NaN     855.0  2012
749  Transit Timing Variations       3             NaN   NaN       NaN  2014
813  Transit Timing Variations       2         22.3395   NaN     339.0  2013

In [64]:
for (method,group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [67]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.000000
       Eclipse Timing Variations           9.000000
       Imaging                            38.000000
       Microlensing                       23.000000
       Orbital Brightness Modulation       3.000000
       Pulsar Timing                       5.000000
       Pulsation Timing Variations         1.000000
       Radial Velocity                   553.000000
       Transit                           397.000000
       Transit Timing Variations           4.000000
mean   Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.131579
       Microlensing                     2009.782609
       Orbital Brightness Modulation    2011.666667
       Pulsar Timing                    1998.400000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2007.518987
       Transit                          2011.236776
       Transit Timing Variations        2012.500000
std    Astrometry                          2.121320
       Eclipse Timing Variations           1.414214
       Imaging                             2.781901
       Microlensing                        2.859697
       Orbital Brightness Modulation       1.154701
       Pulsar Timing                       8.384510
       Pulsation Timing Variations              NaN
       Radial Velocity                     4.249052
       Transit                             2.077867
       Transit Timing Variations           1.290994
                                           ...
50%    Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.000000
       Microlensing                     2010.000000
       Orbital Brightness Modulation    2011.000000
       Pulsar Timing                    1994.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2009.000000
       Transit                          2012.000000
       Transit Timing Variations        2012.500000
75%    Astrometry                       2012.250000
       Eclipse Timing Variations        2011.000000
       Imaging                          2011.000000
       Microlensing                     2012.000000
       Orbital Brightness Modulation    2012.000000
       Pulsar Timing                    2003.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2011.000000
       Transit                          2013.000000
       Transit Timing Variations        2013.250000
max    Astrometry                       2013.000000
       Eclipse Timing Variations        2012.000000
       Imaging                          2013.000000
       Microlensing                     2013.000000
       Orbital Brightness Modulation    2013.000000
       Pulsar Timing                    2011.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2014.000000
       Transit                          2014.000000
       Transit Timing Variations        2014.000000
Length: 80, dtype: float64

In [68]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A','B', 'C'],
                  'data1': range(6),
                  'data2': rng.randint(0,10,6)},
                  columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [69]:
df.groupby('key').aggregate([min, np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [70]:
df.groupby('key').aggregate({'data1': 'min',
                            'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [83]:
def filter_func(x):
    return x['data2'].std()> 4

In [84]:
df.groupby('key').std()

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

In [87]:
df.groupby('key').std()

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

In [85]:
df.groupby('key').filter(filter_func)

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [86]:
df.groupby('key').std()['data2'] > 4

key
A    False
B     True
C     True
Name: data2, dtype: bool

In [88]:
df.groupby('key').aggregate(np.mean)

     data1  data2
key
A      1.5    4.0
B      2.5    3.5
C      3.5    6.0

In [89]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [93]:
def normbydata2(x):
    #x is datafrome of group values
    x['data1'] /= x['data2'].sum()
    return x

print(df.groupby('key').apply(normbydata2))

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [94]:
print(normbydata2(df))

  key     data1  data2
0   A  0.000000      5
1   B  0.037037      0
2   C  0.074074      3
3   A  0.111111      3
4   B  0.148148      7
5   C  0.185185      9

In [95]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A','B', 'C'],
                  'data1': range(6),
                  'data2': rng.randint(0,10,6)},
                  columns = ['key', 'data1', 'data2'])

In [97]:
#like putting ur own index 
L = [0,1,0,1,2,0]
print(df)
print(df.groupby(L).sum())

  key  data1  data2
0   A      0      3
1   B      1      5
2   C      2      2
3   A      3      4
4   B      4      7
5   C      5      6
   data1  data2
0      7     11
1      4      9
2      4      7

In [98]:
df.groupby(df['key']).sum()
#df

     data1  data2
key
A        3      7
B        5     12
C        7      8

In [99]:
df2 = df.set_index('key')
df2

     data1  data2
key
A        0      3
B        1      5
C        2      2
A        3      4
B        4      7
C        5      6

In [101]:

mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
df2.groupby(mapping).sum()

           data1  data2
consonant     12     20
vowel          3      7

In [102]:
df2.groupby(str.lower).mean()

   data1  data2
a    1.5    3.5
b    2.5    6.0
c    3.5    4.0

In [103]:
df2.groupby([str.lower, mapping]).mean()

             data1  data2
a vowel        1.5    3.5
b consonant    2.5    6.0
c consonant    3.5    4.0

In [104]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
#decade
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [ ]:
titanic.head()

In [ ]:
titanic.groupby('sex')[['survived']].mean()

In [ ]:
titanic.groupby(['sex', 'class'])[['survived']].mean().unstack()

In [ ]:
titanic.pivot_table('survived', index='sex', columns='class')

In [ ]:
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

In [ ]:
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

In [ ]:
titanic.pivot_table(index='sex', columns='class',
                   aggfunc= {'survived': sum, 'fare': np.mean})

In [ ]:
titanic.pivot_table('survived', index='sex', columns='class',
                   margins=True)

In [ ]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv

In [ ]:
births = pd.read_csv('births.csv')

In [ ]:
births.head()

In [ ]:
births['decade'] = 10 * (births['year'] // 10)
births.pivot_table('births', index='decade', columns='gender',
                  aggfunc='sum')

In [ ]:
%matplotlib inline
import matplotlib.pyplot as plt
sns.set()
births.pivot_table('births', index='year', 
                   columns='gender', aggfunc='sum').plot()

In [ ]:
quartiles = np.percentile(births['births'], [25, 50, 75])
#mu quartiles[1]
print(quartiles)
mu = quartiles[1]
sig = 0.74 * (quartiles[2] - quartiles[0])
print(sig)

In [ ]:
births = births.query('(births > @mu - 5 * @sig) & (births < @mu + 5 * @sig) ')
#print(births)

In [ ]:
# set 'day' column to integer; it originally was a string due to nulls
births['day'] = births['day'].astype(int)
print(births['day'][:5])

In [ ]:
births.index = pd.to_datetime(10000 * births.year +
                             100 * births.month +
                             births.day, format='%Y%m%d')

In [ ]:
#print(births.index)

In [ ]:
births['dayofweek'] = births.index.dayofweek

In [ ]:
births.pivot_table('births', index='dayofweek',
                   columns='decade',
                   aggfunc= 'mean').plot()
plt.gca().set_xticklabels(['Mon', 'Tues', 'Wed', 'Thurs', 'Fri', 'Sat', 'Sun' ])
plt.ylabel('mean births by day');

In [ ]:
births.head()

In [ ]:
births_by_date = births.pivot_table('births',
                                   [births.index.month, births.index.day])
births_by_date.head()

In [ ]:
fig, ax= plt.subplots(figsize=(12,4))
births_by_date.plot(ax=ax);

In [ ]:
data = ['peter', 'Paul', None, 'MARY', 'gUIDO']
#[s.capitalize() for s in data]
#erro because of missing values in data

In [ ]:
names = pd.Series(data)
names

In [ ]:
names.str.capitalize()

In [ ]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                          'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [ ]:
monte.str.lower()

In [ ]:
monte.str.len()

In [ ]:
monte.str.startswith('T')

In [ ]:
monte.str.split()

In [ ]:
monte.str.extract('([A-Za-z]+)')

In [ ]:
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

In [ ]:
monte.str[0:3]

In [ ]:
monte.str.split().str.get(-1)

In [ ]:
full_monte = pd.DataFrame({'name': monte,
                          'info': ['B|C|D', 'B|D', 'A|C',
                                   'B|D', 'B|C',
                                  'B|C|D']})
full_monte

In [ ]:
full_monte['info'].str.get_dummies('|')

In [ ]:
!curl -O http://openrecipes.s3.amazonaws.com/recipeitems-latest.json'
!gunzip recipeitems-latest.json.gz

In [ ]:
%ls

In [ ]:
try:
    recipes = pd.read_json('recipeitems-latest.json')
except ValueError as e:
    print("ValueError", e)

In [ ]:
from datetime import datetime
datetime(year=2015, month=7, day=4)

In [ ]:
from dateutil import parser
date = parser.parse("4th of July, 2015")
date

In [ ]:
date.strftime('%A')

In [ ]:
date = np.array('2015-07-04', dtype=np.datetime64)
date

In [ ]:
date + np.arange(12)

In [ ]:
np.datetime64('2015-07-05')

In [ ]:
np.datetime64('2015-07-04 12:00')

In [ ]:
np.datetime64('2015-07-04 12:59:59.50', 'ns')

In [ ]:
date = pd.to_datetime('4th of July, 2015')
date

In [ ]:
date.strftime('%A')

In [ ]:
date + pd.to_timedelta(np.arange(12), 'D')

In [ ]:
index = pd.DatetimeIndex(['2014-07-04', '2014-08-04',
                                  '2015-07-04', '2015-08-04'])
data = pd.Series([0,1,2,3], index= index)
data

In [ ]:
data['2014-07-04': '2015-07-04']

In [ ]:
data['2015']

In [ ]:
dates = pd.to_datetime([datetime(2015, 7, 3), '4th of July, 2015',
                       '2015-Jul-6', '07-05-2015', '20150708'])
dates

In [ ]:
dates.to_period('D')

In [ ]:
dates - dates[0]

In [ ]:
pd.date_range('2015-07-03', '2015-07-10')

In [ ]:
pd.date_range('2015-07-04', periods=8, freq='H')

In [ ]:
pd.period_range('2015-07', periods=8, freq='M')

In [ ]:
pd.timedelta_range(0,periods=10, freq="H")

In [ ]:
pd.timedelta_range(0, periods=10, freq='2H30T')

In [ ]:
pd.period_range('2015-01', periods=10, freq='Q-JAN')

In [ ]:
pd.period_range('2015-01', periods=10, freq='W-MON')

In [ ]:
from pandas.tseries.offsets import BDay
pd.date_range('2015-07-08', periods=5, freq=BDay())

In [ ]:
from pandas_datareader import data

In [ ]:
#!pip list

In [ ]:
from pandas_datareader import data
yahoo = data.DataReader('goog', start='2004',
                      end='2016', data_source ='yahoo')
yahoo.head()

In [ ]:
yahoo = goog['Close']

In [ ]:
yahoo.head()

In [ ]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn; seaborn.set()

In [ ]:
yahoo.plot();

In [ ]:
yahoo.plot(alpha=0.5, style='-')
yahoo.resample('BA').mean().plot(style=':')
yahoo.asfreq('BA').plot(style='--');
plt.legend(['input', 'resample', 'asfreq'], 
          loc='upper left');

In [ ]:
fig, ax= plt.subplots(2, sharex=True)
data = yahoo.iloc[:20]
#data
data.asfreq('D').plot(ax=ax[0], marker='o')

data.asfreq('D', method='bfill').plot(ax=ax[1], style='-o')
data.asfreq('D', method='ffill').plot(ax=ax[1], style='--o')
ax[1].legend(['back-fill', 'forward-fill']);

In [ ]:
fig, ax = plt.subplots(3, sharey=True)

yahoo = yahoo.asfreq('D', method='pad')
#yahoo

yahoo.plot(ax=ax[0])
yahoo.shift(900).plot(ax=ax[1])
yahoo.tshift(900).plot(ax=ax[2])

local_max = pd.to_datetime('2007-11-05')
offset = pd.Timedelta(900, 'D')

ax[0].legend(['input'], loc=2)
ax[0].get_xticklabels()[4].set(weight='heavy', color='red')
ax[0].axvline(local_max, alpha=0.3, color='red')

ax[1].legend(['shift(900)'], loc=2)
ax[1].get_xticklabels()[4].set(weight='heavy', color='red')
ax[1].axvline(local_max + offset, alpha=0.3, color='red')

ax[2].legend(['tshift(900)'], loc=2)
ax[2].get_xticklabels()[1].set(weight='heavy', color='red')
ax[2].axvline(local_max + offset, alpha=0.3, color='red');

In [ ]:
ROI = 100 * (yahoo.tshift(-365)/ yahoo -1)
ROI.plot()
plt.ylabel('% Returns of investment');

In [ ]:
rolling = yahoo.rolling(365, center=True)
print(rolling)
data = pd.DataFrame({'input': yahoo,
                    'one-year rolling-mean': rolling.mean(),
                    'one year rolling_std': rolling.std()})
ax = data.plot(style=['-','--',':'])
ax.lines[0].set_alpha(0.3)

In [ ]:
data = pd.read_csv('.\Fremont_Bridge_Hourly_Bicycle_Counts_by_Month_October_2012_to_present.csv', index_col='Date', 
                  parse_dates=True)
data.head()

In [ ]:
data.columns= ['East', 'West']
data['total'] = data.eval('West + East')

In [ ]:
data['total'].head()

In [ ]:
data.dropna().describe()

In [ ]:
data.plot()
plt.ylabel('Hourly Bicycle Count');

In [ ]:
weekly = data.resample('W').sum()
weekly.plot(style=[':', '-', '--'])
plt.ylabel('Weekly bicycle count');

In [ ]:
daily = data.resample('D').sum()
daily.rolling(30, center=True).sum().plot(style=[':','-','--'])
plt.ylabel('mean hourly count');

In [ ]:
daily.rolling(50, center=True,
             win_type='gaussian').sum(std=10).plot(style=[':','-','--'])

In [ ]:
by_time = data.groupby(data.index.time).mean()
hourly_ticks = 4 * 60 * 60 * np.arange(6)
by_time.head()
print(hourly_ticks) 
by_time.plot(xticks=hourly_ticks, style=[':', '-','--'])

In [ ]:
by_weeday = data.groupby(data.index.dayofweek).mean()
by_weeday.index = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun']
by_weeday.plot(style=['-','--',':'])

In [ ]:
weekend = np.where(data.index.weekday < 5, 'Weekday', 'Weekend' )
by_time = data.groupby([weekend, data.index.time]).mean()

In [ ]:
import matplotlib.pyplot as plt
fig,ax = plt.subplots(1,2, figsize=(14,5))
by_time.ix['Weekday'].plot(ax=ax[0], title='Weekdays',
                          xticks=hourly_ticks,
                          style=[':','-','--'])
by_time.ix['Weekend'].plot(ax=ax[1], title='Weeekends',
                          xticks= hourly_ticks,
                          style=[':','-','--'])

In [ ]:
by_time.head()

In [ ]:
nrows, ncols = 100000, 100
df1, df2, df3, df4 = (pd.DataFrame(rng.rand(nrows, ncols))
                             for i in range(4))

In [ ]:
#df2.T[0]
#df3.iloc[0]

In [ ]:
df = pd.DataFrame(rng.rand(1000, 3), columns=['A','B', 'C'])
df.head()

In [ ]:
column_mean = df.mean(1)
result1 = df['A'] + column_mean
result2 = df.eval('A + @column_mean')
np.allclose(result1, result2)

In [ ]:
Cmean = df['C'].mean()
Cmean